{"singlePage": [], "startSite": "", "filingNum": "", "onePageListNum": 15, "commentLabelColor": "#006b75", "yearColorList": ["#bc4c00", "#0969da", "#1f883d", "#A333D0"], "i18n": "CN", "themeMode": "manual", "dayTheme": "light", "nightTheme": "dark", "urlMode": "pinyin", "script": "", "style": "", "indexScript": "", "indexStyle": "", "bottomText": "", "showPostSource": 1, "iconList": {}, "UTC": 8, "rssSplit": "sentence", "exlink": {}, "needComment": 1, "title": "FOSVTrillion Blog", "subTitle": "Providing content with core value, my other side @Hilbert Munger, each piece of content is of high quality and worth chewing and thinking over and over again. Welcome to exchange value for value", "avatarUrl": "https://github.githubassets.com/favicons/favicon.svg", "GMEEK_VERSION": "last", "postListJson": {"P1": {"htmlDir": "docs/post/There must be a way beyond Stanford and Harvard.html", "labels": ["documentation"], "postTitle": "There must be a way beyond Stanford and Harvard", "postUrl": "post/There%20must%20be%20a%20way%20beyond%20Stanford%20and%20Harvard.html", "postSourceUrl": "https://github.com/xingbxinga1/FOSVTrillion/issues/1", "commentNum": 0, "wordCount": 4992, "description": "Let’s put it this way, the first time I wanted to write an article was because of these people, Charlie Munger, Buffett, Steve Jobs, Larry Ellison, Elon Musk, Tesla, and Feynman.\r\n\r\nPlease remember, if you can’t understand Charlie Munger, you can’t understand Buffett. If you don’t understand Buffett, you can’t understand Charlie’s circle of friends, Bill Gates. If you don’t understand Bill Gates, you can’t understand his archenemy, La. Larry Ellison, if you don’t understand Larry Ellison, you will definitely not be able to understand the person he respects the most, Steve Jobs. If you don’t understand Steve Jobs, you will definitely not be able to understand his kindred spirit, Elon Musk. Fortunately, I understand them. We are outliers but also the same kind.\r\n\r\nI met Larry Ellison very early. 10 years ago, when I was a freshman, I browsed through all the courses and lectures at Harvard, Yale, Oxford, Cambridge, and Stanford for the first time. I saw him, that arrogance, that 'Larry Ellison's 2000 Yale University Speech'. I knew that the path I was taking was Charlie Munger's long-term value investment and a very good person, but it did not affect my meeting Larry. Ellison. Because I am also a real young man, a kind of wildness and passion, or a kind of arrogance - if you are Newton, Hilbert, Poincaré, Russell, von Neumann Landau, Charlie Munger, Buffett, Jobs, Bill Gates, Larry Ellison, Elon Musk, Bezos, you will know that this is not a kind of self-righteousness, but a sincere belief that your food follows objective laws, limited rationality, and transcends Bounded rationality and infinite sincerity - A certain faker who did not want to be named also said something similar, you cook like a master\r\n\r\nAfter I met Larry Ellison in my freshman year, I knew that my idea was right. There must be a way beyond Stanford and Harvard. Otherwise, according to the textbook, Newton, Charlie Munger, Buffett, Larry Ellison, and Elon It is impossible for people like Musk to appear at all - this is also one of the opportunities for me to step into a level far beyond the definition of school. The other opportunities are my own independent thinking habits since I was a child, although I have been far away from the beginning. Very schooly\r\n\r\nAfter all, when you face Stanford and Harvard, even if you study for a bachelor's degree, a master's degree, and a Ph.D., the teacher-student ratio is only 1:4 for 4-15 years, and what I do is a teacher-student ratio of 30-100:1 - I am the 100 surrounded by chants. In 2006, I found that even Stanford and Harvard could not meet my needs. I discovered this problem when I was a freshman. For those who can only cross between two subjects or at most three schools, how can they satisfy me that I can have at least 4-6 and normally more than 10 subjects? Neither Stanford nor Harvard can do it, only the outliers can. There is a practical need to be an outlier, and it is a natural thing. But the degree of difficulty requires that it take a hundred years, which cannot be accomplished in a short period of time.\r\n\r\nAs Charlie Munger said about the Lollapalooza effect, I couldn't find any school that could teach me. I had to create it myself - and thankfully, I was already on the road to creation from the beginning. Handmade ice powder, purely hand-kneaded, given by Ollie\r\nIn fact, objectively speaking, I have no idea whether I like Qingbei, Stanford, Harvard, Yale, Cambridge or Oxford. But I know that they don’t like them. It’s not that they don’t like them, but that they don’t like them. They have hats,shackles and anchors. According to other people's rules of the game, they can only become outstanding sheep with an annual salary limit of 200,000 US dollars. At best, they are just sheep and cannot be outstanding. If you want to be in the middle class, top 100 - top 50 - top 30 - top 10 - top 3 are enough.\r\n\r\nBut if you want to be unique, rare, irreproducible and irreplaceable, then there is still a way beyond Stanford and Harvard. This is the true supreme of human civilization, when the stars of mankind are shining brightly.\r\nThe level of the richest man in the world. This level is unique to mankind. You can only create it yourself. They are either dropping out of school or on the way to drop out - that is, even Stanford and Harvard can no longer satisfy them. The school cannot keep up with them. This level is basically what I am. I am my own school, I am my own university. Of course I can't do it, but I long for this state\r\n\r\nHow do you go about using textbook definitions, a group of people who define textbooks? Examination, learning, use, creation, these are different dimensions. Don’t forget what Buffett said: Charlie Munger allowed him to evolve from ape to human. This is a self-effacing statement, but he himself evolved from it, so why does he need others? They are all good partners\r\n\r\nBig bosses are all moved by the sincerity of another big boss, and thus embark on a unique path. Me too。", "top": 0, "createdAt": 1719822254, "style": "", "script": "", "ogImage": "https://github.githubassets.com/favicons/favicon.svg", "createdDate": "2024-07-01", "dateLabelColor": "#bc4c00"}, "P2": {"htmlDir": "docs/post/Beyond the university , into the universe.html", "labels": ["documentation"], "postTitle": "Beyond the university , into the universe", "postUrl": "post/Beyond%20the%20university%20%2C%20into%20the%20universe.html", "postSourceUrl": "https://github.com/xingbxinga1/FOSVTrillion/issues/2", "commentNum": 0, "wordCount": 13510, "description": "https://bkimg.cdn.bcebos.com/pic/503d269759ee3d6dd697119e4d166d224f4ade16?x-bce-process=image/format,f_auto\r\n#Beyond the university , into the universe\r\nThe name is inspired by the subtitle of “Aokana: Four Rhythm Across the Blue”: Beyond the sky, into the firmament. English translation: Beyond the sky, into the firmament\r\nI don’t study in college, I only study the universe - from my practical experience of reading the universe encyclopedia when I was 6 years old\r\nYou guys don’t understand the essence of the university. When I was teaching it to my education teacher in my freshman year—our school doesn’t have an education discipline, but it doesn’t prevent me from finding a teacher of that major. I told her definitely, I don't look at universities, I only look at universities. University is just that you can't get the cosmic level and you are downgraded to a university. Then most people cannot get into university and can only be relegated to a certain industry, then to a certain subject, and then to a certain exam.\r\nYour university is one of the contents of the university, which is one x part. My university is a power structure with the university as the core. That is, I sublimated university into Universe\r\nI started creating my own subject in my freshman year. Although I won’t be able to finish it before I’m 100 years old, at least I’m on the way. Because no one really has a way to teach me how to integrate mathematics, physics, bio-economy, finance, education, philosophy, history, and business into one - and then after I did it myself, I saw that Munger was the same as me, with exactly the same thinking\r\nWhat university do you think you studied at? It's just an industrial assembly line product. For 3 years of quick success, junior high school, high school is like this, university is still like this, it is very pitiful, really, low efficiency, meaningless and homogeneous repetition for more than ten years, what will you do?\r\nI have never thought about graduating from college. I can study in college for a lifetime, a hundred years. You can learn a hundred subjects in one year, 33 in one subject in three years, and ten in each subject in ten years. You can learn three of each in 30 years, and you can learn one of each in a hundred years.\r\nThe problem is that you haven’t learned. So I never thought about graduating from college. For me, I was a 6-year-old undergraduate, and I was still an undergraduate when I was 100 years old. I never thought about graduating from college and becoming a graduate student or doctoral student. When I was 18 years old, I was thinking about how to integrate many disciplines. So I reversed my education degree. I became knowledgeable first, then became my own major, and then became a college student. I have a permanent undergraduate degree, a permanent cash flow, a permanent undergraduate moat, and I put all human knowledge into the university. You are your own university, subject, principal, teacher, dean, student, company\r\nThis is my idea. As I said, I finished reading Wu Jun's 'Road to University' before my freshman year. I chose my own major in university. My understanding of university began when I was 6 years old and watched three episodes of Gorky's 'Childhood'. I already know the parts of 'My Childhood', 'In the World' and 'University', and I know that I am the opposite of 'My Childhood', 'University' and 'In the World' - just like 'Seven Years in the World' by Oxford Primary School Students Similarly, I did know that I would go to college when I was 6 years old. Of course, my family is not from an upper class family, but I knew that I would definitely go - Munger was also 6 years old, and Buffett was 11 years old. I don't know how I will go to university, but my intuition tells me that I can go, the path is uncertain, the method is uncertain, the result is doomed, this is our intuition, Munger also has it, Musk has it, Hilbert Yes, we will eventually know, we will definitely know\r\nThen when I got to college, my idea was very simple, that is, just like my love for eating animal milk,the ten caves and heavens will be one - although I first had this idea, practiced it, and then saw Emperor Huang Tian doing something similar in 'Perfect World' practice. That's me integrating everything into a system - don't ask, Munger did the same thing.\r\nSo when I was automatically promoted to university, I will always be an undergraduate student—even though my university started at the age of 6, and I am still an undergraduate at the age of 100.\r\nI'm not used to going to graduate school, doctoral students, even if it's Stanford or Harvard, -- just like Morgan, Rothschild said, I master the bank, I don't care who makes the law, and Samuelson said, I don't care who is the president Economics I wrote it, and Newton doesn’t care who says it, anyway, what I write is the number one in the world, and the industrial revolution of mankind started with me——mit’s requirements for undergraduates are also the same, and all future people can’t get around me—this That’s called professionalism, and so does Musk and Larry Ellison, and so does Steve Jobs.\r\nWhat do you think your profession is? Just because you entered this major and learned some information? who do you think You Are? With such a big face, others beg you to learn it? Are you a winner in life? living in a dream\r\nSo when I was 18 years old, I watched the speeches of university presidents, including Wu Jun's 'Road to University', and then I watched Larry Ellison's '2000 Yale University Speech' and Jobs' speech. I feel that always being hungry and stupid is very similar to my path to college. The thinking is on the same frequency, that is, I am my own college.\r\n\r\nWhen I was a freshman, I took all the subject class representatives and chatted with the teacher one-on-one\r\nIn my sophomore year, I gave lectures to those 985 undergraduate and master graduate students.\r\nIn my junior year, they couldn't understand what I said, so I got really angry.\r\nSenior year is ready to go out\r\nI earned my blood and got an advantage over Stanford students, because the entire department and all the teachers revolve around you, one-on-one, and for many years will always only give you one-on-one with multiple people.\r\nThere is very little attention paid to the actual education available per capita in China. This is due to the lack of resources and insufficient magnitude. Before college, there are 60 people to one teacher, but after college, there are still 60-200 people to one teacher - 4 to 1 or even 1 at Stanford and Harvard level For 1, it is 60 times our basis. So if I want 1 for many, I have multiple teachers watching me, 1 for N, or even 100N? Neither Stanford nor Harvard can meet my needs. This is Munger’s path, and my path. Including Musk, Larry Ellison. Only create it yourself. The difference is 60N times the base difference.\r\nCan Stanford and Harvard have such a good thing?\r\nIn your sophomore year, tell them that Feynman studied Farah for a whole year. Is this a good thing at Stanford or Harvard?\r\nThey can't understand it in my junior year, so I create it independently. Is this a good thing at Stanford or Harvard?\r\nI started creating my own subjects in my freshman year and wrote about mathematical principles in my fifth year. Is this a good thing at Stanford or Harvard?\r\nNow I am in the ninth year of my university system， can Stanford and Harvard have such a good thing? A university that lasts a hundred years, a continuity that only serves you alone and snowballs throughout your life? Munger and Buffett are both from 100-year universities.\r\n\r\nI have been independent from the beginning. I have never seen anyone below the strongest group in the world, not even Cambridge or Oxford, because they really cannot be outliers. I am only responsible to Munger and the others, so greed will lead to greed. What could be more exciting than having an entire university, major, and department just for you? I am a university myself. I don’t study university, I study universe.\r\nBut I got a more perfect foundation than Stanford and Harvard. The outliers cannot be copied. You have to find your own path. If I don’t cheat, I can’t beat them, so I cheat.\r\n\r\nI tried to integrate 10 disciplines much like the Munger Multiple Mental model, which was my freshman year. Then I saw that Stanford design learning and technology major, emmm, could not meet my needs. Harvard History of the Philosophy of Science, to my taste, but I've been writing about it for years, so I have to go as a professor, not a student. The problem with Stanford design learning and technology is that I have designed my own discipline since I was a freshman. I regard myself as a discipline to study and design my own university system. The inspiration comes from the books A Brief History of Time and Grand Design I read when I was 16. It's all written by Stephen Hawking -- so I've been doing this for 12 years, Stanford's new 2025, well done, don't\r\nSo how am I supposed to be a student? I'm an undergrad, but I don't just listen, I create, and the top universities are a waste of my time. They teach and I do.\r\nI don’t have a rigid need. My rigid need is for more than 10 subjects, whether it is creating my own subjects or creating PCA. Can Stanford help me, or Harvard and Cambridge? I don't have to be alone - Munger can really help me\r\nBecause of necessity, the only thing I read when I was 6 years old was the encyclopedia.\r\nBecause of the urgent need, I established my own library from 18 to 21. I control each book myself before putting it in. \r\nIt is not the kind of book that can be read casually.\r\nBecause of the urgent need, I established my own university at the age of 18\r\nBecause of the urgent need, I created my own multiple Mental model at 18\r\nBecause of the urgent need, I started writing PCA at the age of 27\r\n\r\nWhat you study in college is not a university, but a subject in one of the universities. The problem of diminishing limit margin in a single subject has no solution. This is why the UK cannot beat the US, liberal arts education is too terrible. One part of limx, x tends to ∞, and the whole tends to 0. So you have never gone to college at all, which is the most worrying thing. And this model, unfortunately, in the mobile Internet era, Pinduoduo Taobao 5 yuan 500g, you have never used the learning content above the exam. In the AI ​​era, chat can ask and answer questions by itself, and you are not needed anymore.\r\nAs for what I studied in college, once again, I majored in business, economics, and finance. Although I also studied mathematics, physics, chemistry, biostatistics, sociology, psychology, game theory, history, geography, computer philosophy, science fiction, education, and philosophy of science. Anthropology, Theology, Natural History, etc.\r\n\r\nI just studied by myself, and I didn’t rely on those teachers. Their teachers teach them this way, and they teach you this way, but their learning efficiency and quality are only 10% in listening to the lectures. My learning efficiency has never been lower than 90% since I was a child. I think, read, write, use and create by myself.\r\nWhat will you do? You know nothing, you don’t know what you know.\r\nWhen I was 18 years old, the first person I saw was Lang Xianping, who studied for two years at Wharton School of Business with a master's and doctoral degree - did he rely on his teacher? It's not me yet.\r\n\r\nThe economics I read when I was 16 was Adam Smith, Marx, and Ricardo. When I was 18, I read Samuelson, Mankiw, Hayek, and Keynes. When I was 20, I read Charlie Munger, Buffett, Duan Yongping, Blackstone, and Goldman Sachs. , black stone.\r\nGo see it yourself, count on the teacher? What do you know, a fool of a single subject? Neither does Oxbridge.\r\nMy freshman needs are physics, mathematics, bio-economy, finance, education, philosophy, history, etc. In my ninth year, Stanford and Harvard only offered three subjects. Who can I rely on? Not yourself? Do you expect school teachers? My undergraduate degree is finance, but I have taught myself all of them.\r\nThere is little difference in the quality of Chinese schools outside Qingbei. Anyway, if you haven’t used or created anything, you will always be like this. Only at the level of Yale are you worthy of being called an outstanding sheep in Larry Ellison’s eyes. As for those below Yale, you are not even considered an outstanding sheep. ——Yale-level use of weights—Larry Ellison’s words about surpassing outstanding sheep to create weights—which is what Peter Thiel said about creation from zero to one.\r\nI ask you to be a outliers? Ask you to surpass Stanford and Harvard? Laughed.\r\nI looked for someone from a certain school, and I asked him if he wanted to try to become Newton, but he didn’t have the courage, and if I asked him to become Russell, he didn’t dare. What do you think he can do? There is no way you can 100% ✖ live your life ✖ be professional ✖ focus ✖ yourself ✖ create.\r\n\r\nThey can’t become Charlie Munger, Elon Musk, Larry Ellison, Larry Page, Steve Jobs, or Bill Gates. What’s so interesting about me? Really, from teachers to students, no one has a soul of his own \r\n\r\nYou have to throw away the hat in your heart, you have to stay hungry and stupid forever, you have to have this rigid need for lifelong learning, right? You don’t have this need, you are just imagining it, you have never done it.\r\nYou never have the patience to do something for a hundred years。", "top": 0, "createdAt": 1719822943, "style": "", "script": "", "ogImage": "https://github.githubassets.com/favicons/favicon.svg", "createdDate": "2024-07-01", "dateLabelColor": "#bc4c00"}, "P3": {"htmlDir": "docs/post/The 12.8 billion-year global picture of the universe, Goldilocks zone earth era, Decisive Moment in History.html", "labels": ["documentation"], "postTitle": "The 12.8 billion-year global picture of the universe, Goldilocks zone earth era, Decisive Moment in History", "postUrl": "post/The%2012.8%20billion-year%20global%20picture%20of%20the%20universe%2C%20Goldilocks%20zone%20earth%20era%2C%20Decisive%20Moment%20in%20History.html", "postSourceUrl": "https://github.com/xingbxinga1/FOSVTrillion/issues/3", "commentNum": 0, "wordCount": 8623, "description": "Prove\r\n\r\nThe Earth is 6,700km - the Earth-Moon system is 380,000km - the eight planets. The distance from the Earth to the sun is 150 million kilometers to one astronomical unit, to Pluto is 30 astronomical units, to the Kuiper belt is 30-50 astronomical units, and to the Australian Erte Cloud is 50,000 astronomical units to one Light years, the radius of the solar system star system is 3 light years, including the coronal heliosphere to the Lagrangian point where the gravitational radius affects the balance with the Milky Way - the Milky Way galaxy is 120,000 light years in diameter - the Milky Way belongs to the Virgo Supercluster 110 million light years year - the Virgo Supercluster belongs to the Laniakea Supercluster 520 million light years - the composition of Laniakea and Hercules North, Pisces, Sloan Great Wall (the origin of the name of the Sloan Digital Sky Survey), etc. is known The largest structure of the universe is also called the cosmic thread structure - very similar to the neurons of the human brain - and then multiple cosmic thread structures constitute the undercurrent of the universe - the undercurrent of the universe surges, forming the scope of the observable universe - the diameter of the scope of the observable universe 96 billion light-years - and the observable universe is just because light can only travel so far in these 12.8 billion years, it does not mean that the universe has experienced 100,000 years of inflation and subsequent secondary acceleration, and now the inflation mode has stopped, so outside the observable universe, Is it the inflationary universe - the observable universe is just a non-empty proper subset of the inflationary universe, that is, the unobservable universe interval outside the observable universe? Light years?\r\n\r\nThe content I collected is a lot of content from the 6-18-year-old bosses. From 18-21, I set up my own library. From the age of 18, I have been thinking and creating independently.\r\n\r\nThis content has been done by Munger, by Kaufman, from one to infinity by Gamow, by Hawking's brief history of time, what is life by Schrödinger, by the creator of the second law of thermodynamics and by Boltzmann However, all big science experts have done it. Mr. Newton did it on the principles of mathematics, Einstein did it on the theory of relativity, principle Dario did it, Wu Jun wrote 'History of Science' and 'Top of the Tide', Mr. Hararih Wrote 'A Brief History of Humanity', someone wrote 'General History of Science', Santa Fe Institute wrote 'Big History' and 'Scale' and 'Origin of Wealth', Mao Zedong wrote 'Reading History', 'Assassin's Creed' There are a series of them, 'Modern China' written by Li Lu, and Harvard and Stanford made a history of philosophy of science\r\n\r\nThis part of the content can really test your logical reasoning ability and mathematical skills, and I have never taught it above the freshman year. This is my principle for using the Feynman learning method:\r\n\r\nAnd within the collection of the observable universe of this universe, the big boom is 12.8 billion years old, the third-generation star system is 5 billion years old, the Goldilocks region earth is 4.6 billion years old, inorganic matter to organic matter is 3 billion years old, the pronucleus of life is 1.8 billion years old, and then single cells Life with a nucleus, DNA, RNA, multicellular organisms, anaerobic biological generations, and mitochondria participate in oxygen production to improve energy consumption and work ability. When oxygen is required, multicellular organisms continue to the present mammalian organisms and civilization (high school students aged 13-18 content)\r\n\r\nSchrödinger used the theories of thermodynamics and quantum mechanics to explain the essence of life: he used concepts such as 'non-periodic crystals', 'negative entropy', 'genetic code', and 'quantum jump mutation' to explain the material structure of organisms, the maintenance and continuation of life, and heredity. , that is, the inverse entropy system\r\n\r\nIf you only know the popular book 'The Selfish Gene' in the 1960s, you don't know why genes are selfish, and you don't know what 'Complex' is. The book 'Complicated' comes from 'What is Life'. If you don't know 'What is Life', you can't understand the popular best-sellers 'Mysterious Quantum Life' and 'Life 3.0', which discuss the possibility of whether AI will become life, and the concepts of carbon-based life and silicon-based life. And the post bar brother is widely circulated. This is a stalk that carbon-based organisms can come up with. Naturally, there are also 'Minecraft' and 'Decisive Moment in History' brother ecstasy.\r\n\r\n\r\nOnly when you know what the essence of life is, will you be in awe of everything, be moved by the miracle of all life, and be in awe of how hard it is to have life on this planet, will you be in awe of the earth, cherish life, understand civilization, and create the meaning of the industrial revolution. Only when we understand the struggle between machines and humans can we understand the meaning of the ecosystem and insist on sustainable development. Only then will we be in awe of nature, cherish the foundation of life, and understand how big the universe is, the meaning of stars, and the course of human history. This universe is different because of life.\r\n\r\nLife is worthy of praise, and the anti-entropy system is the greatest miracle. It spans from the Big Bang 12.8 billion years ago to the third star system 5 billion years ago, 4.6 billion years ago, and the earth transforms inorganic matter into organic matter 3 billion years ago. The ultimate leap begins with the eukaryotic cell. Madness evolves inside the earth, from cells to multi-cells to invertebrates to vertebrates to mammals to the human era to primitive society to slave society to agricultural society to the industrial revolution society to the commodity age to now. Humanity has just begun and can Only when you understand who you are can you know where you came from, and then you will be qualified to prepare where you are going. Only then can we be in awe of how hard-won all of this is, in awe of what people are doing, and God who is watching, and in awe of the gods with their heads raised. Only then can science, philosophy, theology, science fiction, the unknown, etc. be harmonious, guide themselves, and reflect on their own actions and paths. , will test yourself.\r\n\r\nYou can understand that this is a continuous effort that has lasted for decades. You can understand that this is the effort of three hundred years of industrial revolution, three thousand years of farming civilization,and eight thousand years of human civilization. You can also understand that this is the effort of evolution for tens of millions of years. You can better understand that this is the effort of billions of years of earth's history, and you can better understand that this is the convergence of cause and effect that has taken 12.8 billion years of the universe. This is the result of the combined efforts of all known and unknown. We must cherish and revere, we must inherit the path created by the joint efforts of past causes and effects and predecessors, and we must continue to move forward and continue to open up new paths. The essence of the brilliance of the stars of mankind is that all people work together to create history—Marx’s view of history, the essence of Decisive Moment in History is the brilliance of the stars of the universe—the scientific view of history, as Hilbert said, we will eventually know, we will know. We will create, we will create\r\n\r\nSo this is that our universe is the best one I've ever seen - I've proven what Leibniz said\r\n\r\n\r\nAlthough my own knowledge maps were collected from ages 6 to 18, I was already creating my own disciplines, sciences, industries, positions, universities, and university systems when I was 18 years old, but I can use this thing for a lifetime.\r\n\r\nFrom 18 to 21, I tried to create my own disciplines, mathematics, physics, biology, economics, finance, education, social politics, psychology, history, philosophy - once again, my freshman needs are physics, mathematics, economics, finance, education and philosophy. I’m sorry, I have to follow Munger’s example and come here by myself—this kind of feeling probably isn’t it, isn’t it, “I’ve already proved the Tao and become the emperor, why did the golden finger come here”? But unfortunately I can't do it. It's too difficult. Munger has done it for a hundred years. I can't do it in less than a hundred years. It will take my whole life.\r\n\r\n。", "top": 0, "createdAt": 1719823593, "style": "", "script": "", "ogImage": "https://github.githubassets.com/favicons/favicon.svg", "createdDate": "2024-07-01", "dateLabelColor": "#bc4c00"}, "P4": {"htmlDir": "docs/post/ -The smartest person I have ever met is one who does not read-, and further- I have met the smartest person, there is no one who does not read, do not study physics and mathematics, and do not study throughout his life.html", "labels": ["documentation"], "postTitle": " \"The smartest person I have ever met is one who does not read\", and further: I have met the smartest person, there is no one who does not read, do not study physics and mathematics, and do not study throughout his life", "postUrl": "post/%20-The%20smartest%20person%20I%20have%20ever%20met%20is%20one%20who%20does%20not%20read-%2C%20and%20further-%20I%20have%20met%20the%20smartest%20person%2C%20there%20is%20no%20one%20who%20does%20not%20read%2C%20do%20not%20study%20physics%20and%20mathematics%2C%20and%20do%20not%20study%20throughout%20his%20life.html", "postSourceUrl": "https://github.com/xingbxinga1/FOSVTrillion/issues/4", "commentNum": 0, "wordCount": 6154, "description": "Axiom\r\nProve\r\nThe smartest people must study physics and mathematics. By the way, the origin of physics and mathematics of the big guys-in fact, physics and mathematics are not separated. Mathematics is the underlying logic of physics. The two are twin symbiotic relationships. There is no physics and mathematics. Physics without mathematics is meaningless.\r\n\r\nMathematics and physics are symbiotic, from Aristotle, Euclid, Archimedes, to Pascal, Descartes, Galileo, Copernicus, to Newton, Leibniz, Hooke, Halley, etc. People, to people like Euler, Lagrange and Laplace, to people like Cosy Gauss, Galois, Abel Riemann, to people like Möbius Klein, Hilbert Poincaré, Einstein von Neumann People like Yiman, mathematics and physics all coexist\r\nAnd what I will talk about next is not pure physics and mathematics, but the big guys based on the integration of mathematics and physics, physics - business. In fact, physics and business are also symbiotic relationships. What is worth celebrating is that my first instinct when learning physics was this, and I am self-taught\r\n\r\nThe big guy’s synthetic formula is bound to drop out of school—Munger has to go to school many times, and he must accept the direct influence of another group of top big shots—Einstein, Feng Nuoyi, Franklin, they must learn physics and mathematics, and they must learn by themselves. Well, the foundation of the boss is ready.\r\n\r\nSynthetic formula, influenced by another group of bosses × dropping out of school for many times × self-study × physics and mathematics\r\n\r\nCharlie Munger, my favorite, also dropped out of school several times without completing his degree. However, he majored in mathematics at the advanced University of Michigan, and then was attracted to physics - Einstein was his guide, and then entered the university during World War II. Caltech - yes, the one you know. He and Qian Xuesen are alumni. He studied thermodynamics and meteorology - yes, one of von Neumann's main subjects, one of the founders of complex subjects, chaotic systems and Second law of thermodynamics. Then there's Harvard Law School\r\n\r\nI still say the same thing, you don't even know what the bosses have gone through, but he can be directly educated by Einstein, von Neumann, and quantum sender Landau Feynman! And he was definitely the first to come into contact with complex science and business enlightenment, so he was very handy. This is a typical 'outlier' person\r\nAs for economics, he was one of the earliest readers of 'Mankiw Economics' and grew up after reading this economics for decades, although it was more academic.\r\n\r\nThen let’s talk about Bezos. Bezos is a physics major, and his classmates are all physics masters. These people all have a Langdao score of about 2.5, and their goal is to pursue the Nobel Prize level, which is the Langdao score of 1.5. Bezos couldn't beat people, so he defined the boundaries of his circle of competence and changed his major. I still say the same thing, it's more important for you to know the boundaries of your circle of competence than how many abilities you have. Then he may not necessarily become the top in physics, but he still has physics thinking.\r\n\r\nThen talk about Larry Ellison, the first principle and Feynman learning method are not the first to be used by Elon Musk, Charlie Munger's extraordinary rationality is the earliest, and then Larry Ellison, Bill Gate tz. Larry Ellison is truly self-taught, as can be seen from his several dropouts, but he must have iterated on his own learning, and his learning efficiency is extremely high. As long as you don't have a hat in your heart, you can surpass Stanford, Harvard, Yale, Oxford and Cambridge. This is the real path. Stanford and Harvard are just qualified to enter this path.\r\n\r\nThen there is Elon Musk. Others are really masters of physics. Just ask SpaceX and Tesla and you will know. Don't repeat it. But the essence of it is not the first principle - I knew that thing 20 years ago. At that time, we called it the first driving force, and it was so hard to throw up. What I want to say is what he said, you can violate the law, humanities and other man-made content, because people can violate it, but you cannot violate the laws of physics, because nature cannot violate it. This sentence is equivalent to Charlie Munger's bounded rationality-this is why neither Munger nor I like the academic school of economics, and it is also equivalent to the first principle-the first driving force, which is also equivalent to Marx's practical philosophy and seeking truth from facts and following objective laws\r\n\r\nLet’s talk about Musk again, which will be explained in detail later in Silicon Valley Fire. Like Larry Ellison, Bill Gates, Bezos, and Larry Page, he was deeply affected by the fire of Silicon Valley and Bell Labs. So who influenced Bell Labs? Engineer culture. So who influenced Bell Labs? The group of Nobel Prize winners in physics, and they came from Turing Shannon Feynman and others, and Turing Shannon Feynman was influenced by von Neumann, Einstein, von Neumann Einstein, they were influenced by Hill Bert, Poincaré, this is the legacy\r\n\r\nAnd the important thing to mention is Tesla. Tesla is an engineer and creator. He directly influenced Elon Musk - just like Franklin and Charlie Munger. Turing and Newton influenced Jobs. The same, so the bigwigs are passed down from generation to generation. Silicon Valley can be seen as an emergence mechanism cultivated by a group of environmental soils with Langdao scores of 0.5-1.5 - which is much more difficult than chaos.\r\n\r\nNewton\r\nHilbert, Poincaré, Tesla\r\nOld love, von Neumann, Russell\r\nTuring, Shannon, Nash, Godel, Samuelson\r\nCharlie Munger, Warren Buffett\r\nbell labs\r\nBill Gates, Larry Ellison\r\nLarry Page, Bezos\r\nElon Musk, Steve Jobs\r\nMe\r\n?\r\n?\r\n\r\nThe relationship is probably like this. So, where is our heritage? Where are we? Do our smartest people study physics, mathematics, and computers?\r\nThis horse is inherited from the seventh generation, and now it has reached the seventh generation, which is Elon Musk at the level of Naruto.\r\nOf course, I inherited Munger’s content.。", "top": 0, "createdAt": 1719824209, "style": "", "script": "", "ogImage": "https://github.githubassets.com/favicons/favicon.svg", "createdDate": "2024-07-01", "dateLabelColor": "#bc4c00"}, "P5": {"htmlDir": "docs/post/AI, Science and Education.html", "labels": ["documentation"], "postTitle": "AI, Science and Education", "postUrl": "post/AI%2C%20Science%20and%20Education.html", "postSourceUrl": "https://github.com/xingbxinga1/FOSVTrillion/issues/5", "commentNum": 0, "wordCount": 18620, "description": "I have said this in 2017. If you don't believe me, read my previous six questions about AI and my analysis of human-computer interaction with Elon Musk. Ren Zhengfei and Jack Ma have also said similar things. If you can't compete with machines by learning machines, what are you learning? You learn in vain. The test machines are really rubbish. Do you think that you can only take tests and be useful?\r\n\r\nI knew how bad this was in 2017, because I have a clear view of China's education problems, a bunch of inefficient, meaningless, and repetitive. When faced with the impact of almost free AI, with richer information flow than you - others have a database of tens of billions of information, and their labor is cheaper than yours - you have to pay tens of thousands of yuan a month while others do it for free, how can you beat them? Kai-Fu Lee talked about this issue in 'AI Future', and the replacement rate in developing countries is more than 80% - this is the prediction for 2017.\r\n\r\nBut I know that since most people have never thought independently - this proportion is considered low even if it is above 90% - the actual number may be even worse, 99%, basically less than one thousandth of them can really think independently. So, once the AI ​​upgrades and impacts, how can you fight it?\r\n\r\nMost people are complacent and think that the world is vast. Ordinary people think that they have studied for 20 years, including 6 years in primary school, 6 years in middle school, 4 years in college, 3 years in graduate school and doctoral degree. The aristocratic families are complacent, for example, a certain person has a fifty-year network of connections - look at what you have achieved in 20 years, what Newton achieved in 20 years, what AI achieved in 20 years, really, you have learned nothing in 20 years, I really don't know where your confidence comes from?\r\n\r\nYou can do as Carter said to Morgana Liang Bing in 'Super Seminary', I have three thousand years, Liang Bing replied, I have thirty thousand years - and Principal Jilan's big clock of old time - one hundred thousand years. And AI training accumulates millions of years. I still don't know why they are living in a dream. This impact is unimaginable to them. It is beyond their cognitive circle and ability circle - by the way, I am one of the earliest Tencent video users who support 'Super Seminary Black Armor'. The first one to get into it was 'Lalala Demacia', including 'Fox Spirit Matchmaker' and 'SPY×FAMILY'. I am one of the first batch of people who really paid for it.\r\n\r\nDo you know what I see - I saw this pattern ten years ago. It is similar to the disintegration of feudal farming by the rise of the bourgeoisie based on the underlying logic of gunpowder created by science, chemistry, mathematics and physics. The knight landlord class disintegrated the bronze and slash-and-burn agriculture two thousand years ago due to the acquisition of iron tools due to productivity. In the 17th century, the systematic scientific and technological revolution brought about by Newton's 'Mathematical Principles of Natural Philosophy' was forced to disintegrate. This moment is exactly like that moment. How could it be so similar?\r\n\r\nIf you have read Guns, Germs, you will know - that is the teacher of Yuval Noah Harari who wrote 'Sapiens: A Brief History of Humankind'. You can learn more about it by reading Columbia Exchange for IELTS. How the landlord knight class disintegrated the feudal society a thousand years ago, and how the industrial revolution and steel disintegrated the knights five hundred years ago, what goes around comes around. A knight with a training period of twenty years, that is, it takes twenty years to train him, can be knocked down by one bullet - this is subversive content, you have twenty years, I have 2S, this exchange ratio is not proportional. This is because the differential variables are different, and then the integral is even more different, the gap is getting bigger and bigger - the density is different, the volume is different, the mass is different, p ✖ ️v＝m\r\n\r\nThe essence of revolutionary productivity explosion is disruptive innovation, and innovation comes from basic science. - In reverse, science brings innovation and innovation brings productivity. Whether it is the first scientific revolution in Britain that benefited from the scientific dividends of Newton, or Leibniz who was forced to go to France and brought calculus to France, or the influence of Euler's disciples Laplace and Lagrange on France - guess how Napoleon could quickly rise to power? He graduated from the artillery, a standard top student - if you want to be a king, learn calculus. And the chief French scientist is Laplace, a disciple of Euler.\r\n\r\nScience and scientists have no borders. The essence is that my scientists are the world's top scientists, influencing the whole world. This is much more powerful than collecting monetary taxes. As long as it is in this field, you can't get around me - otherwise, what do you think the Nobel Prize is? That is a strategic-level scientist, with strategic influence for more than 30 to 50 years in the future, and the right to speak in the future.\r\n\r\nHow can it cover the whole world? Science brings technology, technology brings productivity, productivity generates interaction, and interaction affects more distant regions. This is radiation geopolitics.\r\n\r\nThe earliest application of calculus was to more accurately shove cannonballs into other people's asses and foreheads - for details, please refer to Napoleon. Of course, it is different now. Now it is all about shoving nuclear warheads into other people's asses from tens of thousands of kilometers away - of course, here we must consider the influence of large mass celestial bodies, planetary mass effects, and high-speed object effects - that is, relativity. Why do people always love Newton? If you understand, you will understand.\r\n\r\nSo the Industrial Revolution was started by Newton, so he was the first. Then the first, second, and even third industrial revolutions were laid by scientists, and then commercial infrastructure was formed, and then it was popularized to the public. The foundation of the public was the commercial foundation - the early stage of the third industrial revolution was the Internet computer and architecture, based on military content. The commercial foundation was science and technology - the Manhattan Project, including but not limited to Einstein, von Neumann, Oppenheimer, Feynman - of course Qian Xuesen was still a young man of the third generation at that time. The basic reserve of talents for the Manhattan Project came from the Third Solvay Conference - the Nobel Prize winners in pure physics, chemistry and biology - now you know how big the gap is, why do we need to have a theoretical foundation? You also know why the Nobel Prize has such a high status in the world. And what is the origin of the group of Nobel Prize winners back then? Mathematical physics all-rounders, Einstein, Hilbert, Poincare, von Neumann, Russell. Listen to who their disciples are: Planck, Bohr, Old Love, Feynman, Landau, Wittgenstein, Gödel, Turing, Shannon, Nash, Samuelson. To be honest, the third industrial revolution was really dominated by this family.\r\n\r\nGuess who was responsible for the second industrial revolution and the first one? The second industrial revolution, electromagnetism, Faraday, Tesla, Franklin, Edison, radio, etc. And the origin of this revolution was Laplace, Lagrange, and Maxwell.\r\n\r\nWho was the originator of the first industrial revolution? Diderot's Encyclopedia, and before that, Watt's improvements, etc. And before that, Newton, Leibniz, Descartes, Kepler, Galileo, etc.\r\n\r\nBasic science is the foundation of the industrial revolution, the foundation of modern civilization, and the origin of modern times, so Newton and Einstein cannot be avoided.\r\n\r\nIn the late stage of the Second Industrial Revolution, Marx came to his senses and had an essential understanding of human civilization. He proposed the concepts of productivity, production relations and surplus value.\r\n\r\nThen in the late third industrial revolution, now, well, the education system of the three hundred years of the industrial revolution, similar to the twenty years of knight training, has reappeared. This time it is not the knight master, but the college master, and he works in a job for decades. In the first industrial revolution and the early second industrial revolution, because the time rate of change of productivity was not too fast, only one job was needed for a lifetime, so there were not many changes. In the early third industrial revolution, the explosion of job demand in the 1960s-1990s hedged the risk, and the Internet dividend exploded. In the middle of the third industrial revolution, from the 1990s to the 2020s, the changes accelerated again, and the stability of a job, industry, and work was greatly weakened, so there were not enough jobs. The education system based on the second industrial revolution and the early third industrial revolution - an industry that can be maintained for a hundred years, which brought about industry jobs and stable majors, has disappeared.\r\n\r\nI once asked my classmates when I was 18 years old-2013, what would you do if the current industry died? What if the elimination rate of your major is greater than the time of your job position? In other words, the last and most extreme case, before you graduate, or even while you are filling out your application, your major has been eliminated, what would you do? Even more ruthless, AI comes, what would you do if the thing you cultivated for 20 years is replaced by AI in 2 seconds and it is free? The cost gap is huge, you need 20 years of cost, but the income is not enough for others' 2SAI, to what extent will college students depreciate? Wake up from sleep at night, adults, the times have changed, what would you do?\r\n\r\nYou have to know that these college students who know nothing really know nothing. They don’t know what they know, nor do they know what they don’t know. They also don’t have the ability to think logically. However, AI mathematical logic is much better than college students. This is really a joke from hell.\r\n\r\nThe first to bear the brunt are those humanities and arts disciplines. Liu Cixin's short stories are the essence. If you learn about 'Poetry', you can always get a poem with infinite permutations and combinations - this is the earliest concept in infinite series. As long as you have infinite monkeys, you can type 'Shakespeare'. 'Entering the Immortal Cultivation' also talked about how to cultivate immortality scientifically.\r\n\r\nSo I don't understand why these people can remain indifferent to the 21st century, which is similar to the situation of the bourgeoisie when the knight class was declining. I don't understand but I am shocked. So I knew it when I was 18 years old. Before entering university, I had a clear understanding of the process of the world's industrial revolution, thanks to scientists such as Marx, Newton, Einstein, and Tesla, and also thanks to Silicon Valley fires such as Ellison, Larry Page, Elon Musk, and Bill Gates, as well as public lectures at Stanford, Harvard, and MIT.\r\n\r\nThe problem with Chinese students is that if you compete with machines and can only do questions, then you will definitely die, because you don’t have independent thinking. Once the machine comes, where can you escape? 2S bullets can kill knights, and 2S AI can also make college students lose their jobs, even before you get a job. If you learn to work like a machine, you will die suddenly in three days, and the machine can run for a hundred years - anyone who chooses to do questions like a machine will die faster the more they do, because you don’t know how to use tools. If you learn from machines but can’t compete with them, what’s the point?\r\n\r\nThis is low quality, low efficiency and meaningless repetition, and you are cheap. Because you don't think independently, you don't think independently, you think this way, he thinks this way, and all 1.4 billion people in China think this way, homogeneous, so naturally supply> demand - microeconomics common sense - of course, the microeconomics you learn and I learn are two different concepts. So, once the environmental capacity is limited and the demand is limited, guess what the result will be? That is a run, a run, there is no need for so much demand, but you supply so much, then naturally there is only cheap and free, the more you do, the more mistakes you make, because the direction is wrong.\r\n\r\nHomogeneity and bank runs will inevitably lead to vicious competition and cheapness. In order to survive, this vicious cycle will inevitably lead to bad money driving out good money and adverse selection, that is, the quality of college students will be deteriorating to an incredible degree - you don’t think the world is isolated, do you? If every differential variable is bad, how can the whole be good?\r\n\r\nSo college students, professionals, industry practitioners, white-collar workers, it takes twenty years to come up, and now 2S has been destroyed by AI. \r\n\r\nThe last time it was so exciting was the transition from agricultural productivity to industrial technological revolution productivity - that is, the feudal landlords became capitalist countries. It's really exciting. It's a true witness to history, of course all history is contemporary history\r\n\r\nI suggest you play the 'Assassin's Creed' series and participate in it. There are a lot of historical celebrities.\r\n\r\nBefore the third industrial revolution, you could barely do this. But after the third industrial revolution, what can you do? AI doesn’t care about you. Your logical thinking ability is not as good as AI. How can you compete? Do you still need a test-taking machine? This is not because I actively avoided the test-taking machine in high school, but because I passively did not allow the test-taking machine to do so.\r\n\r\nWell, the old prophet is here. In December 2022, Chat is out. These moats, bandwidth redundancy and buffers that you should have avoided in college and formed with college as your last chance, have been wasted. Naturally, there is no such opportunity.\r\nIf you ask me what education is, I will tell you that education is the ability to influence the future, define the power, and set prices. In other words, education is the ability to face the future. In financial terms, it is the ability to hedge and not depreciate. Nobel Prize winners have the power to set prices and define the future for the next fifty years. Of course, the same is true for business giants.\r\n\r\nThe world's number one country must dominate, or in other words, reap all the benefits of an industrial revolution. You have a chance only if you create an industrial revolution. The first industrial revolution was Britain, Newton, and the steam engine. The second industrial revolution was Germany and the United States. Of course, Germany's benefits were consumed by the two world wars, and the United States packed up the basic scientific reserve talents for the entire third industrial revolution, with a Landau score of 0.5-1.5, and an epic deluxe all-star lineup. As one rises and the other falls, the United States survives and Germany dies. Of course, it is true that the Soviet Union can keep up.\r\n\r\nThen came the third industrial revolution, astrophysics, the credit of old love, and von Neumann, computers and the Internet. The dividends of the entire third industrial revolution have been reaped until now, and it has entered the late stage. 60-90, 90-20, 20-50, now it has entered the late stage\r\n\r\nChina has missed three industrial revolutions - three complete ones. This is the story of a young country and five hundred years of basic science. We still have to work hard in the future. If you want to become the world's number one, a complete industrial revolution is indispensable - if you have watched 'The King of Kings' and 'I Became the Emperor, and the Golden Finger Will Come', you will know what I am talking about. No matter which country it is, it must guide and establish an industrial revolution to become the world's number one - and this must depend on basic research and science. Basic science depends on education\r\n\r\nI just can't understand, the amount of information that an average person takes in in a lifetime from the Middle Ages is about the same as the amount of information in a newspaper today, to the transition to the first, second, and third industrial revolutions, to the current Internet era, the mobile Internet era, and the AI ​​Internet era in the past two months, your brain organs have evolved for three hundred years and have not evolved much, and should use the configuration of tens of thousands of years ago - that is, linear increase, while the exponential explosion of information flow has reached the nth power, this death cross, can you really bear it? The brain has not changed, the information load is full - just like using a 980 graphics card to drive a 3A masterpiece that requires a full-blooded 4090ti - I did not hint at the optimization of 2077 that was criticized. How dare you still have information overload?\r\n\r\nGo and see what happens when you run large programs on your computer. Naturally, you will get stuck. More than 80% of computers will get stuck. Do you think you are special and your brain is made of iron so it won’t happen?\r\nDon't do things beyond your circle of competence, otherwise you will be locked in and you will never have any chance again.\r\nOf course, if you can't achieve the 10,000-hour genius rule, you can try the 10,000-article genius rule. I have practiced it. I am the Baidu dad mode. 365 days a year, 30 articles a day, and you will have read 10,000 articles in a year. Of course, 30,000 articles in three years. If it doesn't work, you can also do 3-10 articles a day. Only collect the highest quality content in a year, and only 50 articles are enough.\r\nI am not a cheap product fed by AI and Chat corpus, I am fed by the entire human civilization and the Internet. I am connected to the entire human civilization, Chat, I laughed, AI can't cultivate outliers of my magnitude, only those sincere people when human civilization was shining. This is Russell's starry sky morality and infinite sympathy for human suffering.\r\n\r\n##Sincerity as Hilbert said,Wir müssen wissen,wir werden wissen！\r\n##Sincerity as Charlie Munger does,,Wir müssen invest,wir werden invest！。", "top": 0, "createdAt": 1719829652, "style": "", "script": "", "ogImage": "https://github.githubassets.com/favicons/favicon.svg", "createdDate": "2024-07-01", "dateLabelColor": "#bc4c00"}, "P6": {"htmlDir": "docs/post/Interdisciplinary + How do you define people who read textbooks with textbook definitions-.html", "labels": ["documentation"], "postTitle": "Interdisciplinary + How do you define people who read textbooks with textbook definitions?", "postUrl": "post/Interdisciplinary%20%2B%20How%20do%20you%20define%20people%20who%20read%20textbooks%20with%20textbook%20definitions-.html", "postSourceUrl": "https://github.com/xingbxinga1/FOSVTrillion/issues/6", "commentNum": 0, "wordCount": 2918, "description": "If you are interested in interdisciplinary studies, I recommend you try \r\n\r\nHarvard History of Philosophy of Science\r\n\r\nStanford design learning and technology\r\n\r\nJohns Hopkins steam\r\n\r\nDuke University design own major\r\n\r\nUCL PPE MA\r\n\r\nThese can basically achieve the intersection of three disciplines\r\n\r\nBased on my practical experience in the top 50, 30, and 10 schools in the world over the years, basically the top 10 can achieve three interdisciplinary cross-disciplines, and the top 30 can achieve two. \r\n\r\nStanford Closed Loop University 2025 will be better. \r\n\r\nOf course, if you are interested in more, you can try the Santa Fe Institute, Hofstadter, Michel, the author of Guns, Steel, and Germs, the Silicon Valley gang, and the two peaks of value investing.\r\n\r\nOf course, my life experience is quite strange. My freshman requirement is ten subjects (Emoji! Emoji！ Emoji！) So I can't solve the problem by entering school. There is no ready-made answer.\r\n\r\nI just dropped out of school like Charlie Munger and Elon Musk. I will do it by myself and create it myself (cry! cry! cry!)\r\n\r\n|\r\n\r\nHow to use subject definite who definite subject？\r\n\r\nHow to use past subject Create who Create future subject？\r\n\r\n|\r\n\r\nName Hilbert Munger\r\n\r\nMale, 28 years old\r\n\r\nStyle: Polymath, encyclopedia, lollapalooza, The Tao of Munger, Value Invest\r\nHave My Own Library，Mutipile Mental Models，Poor Charlies Almanack\r\n\r\n|\r\n\r\n30000h➕，13500books➕，100 Mental Models➕，10subjects➕，3 lifetime partners，72 edition poor Charlie almanack\r\n\r\n|\r\n\r\nLike Munger, Buffett, and Musk, I visited the library at the age of 6-12, and built my own library, multiple thinking models, and disciplines at the age of 18-21.\r\n\r\n|\r\n\r\nA freshman needs to integrate ten subjects, but Stanford only has three in the ninth year. No one can teach me, so I have to do it myself like Munger. I will do it by myself.\r\n\r\n20-28 Abandoning degrees from Stanford and Harvard to focus on creating a Poor Charlie's Almanack\r\n\r\nAfter I put this into practice, I saw a man named Munger who had the same idea as me and had been doing it for a hundred years. I was very happy.\r\n\r\n\r\n\r\nI can guarantee that:\r\n\r\n1.100% original, I first thought about the problem and practiced it myself, and then I found someone who thought in the same frequency as me after I succeeded, and then I found Munger\r\n\r\n2. Analyze the trillion-level generalists, and use the Feynman learning method to reduce it to a level that ordinary people can understand\r\n\r\n3. Abandoned degrees from Stanford and Harvard, and spent eight years focusing on creating my own Poor Charlie's Almanack. I can't understand it if I can't create it\r\n\r\n4. For the analysis of generalists and outliers, I am a practitioner rather than an academic - I also practiced and succeeded in this path. I am a natural encyclopedia school. I started to build my own library in my freshman year, and I have a multiple mental model。", "top": 0, "createdAt": 1719847232, "style": "", "script": "", "ogImage": "https://github.githubassets.com/favicons/favicon.svg", "createdDate": "2024-07-01", "dateLabelColor": "#bc4c00"}}, "singeListJson": {}, "labelColorDict": {"bug": "#d73a4a", "documentation": "#0075ca", "duplicate": "#cfd3d7", "enhancement": "#a2eeef", "good first issue": "#7057ff", "help wanted": "#008672", "invalid": "#e4e669", "question": "#d876e3", "wontfix": "#ffffff"}, "displayTitle": "FOSVTrillion Blog", "faviconUrl": "https://github.githubassets.com/favicons/favicon.svg", "ogImage": "https://github.githubassets.com/favicons/favicon.svg", "primerCSS": "<link href='https://mirrors.sustech.edu.cn/cdnjs/ajax/libs/Primer/21.0.7/primer.css' rel='stylesheet' />", "homeUrl": "https://xingbxinga1.github.io/FOSVTrillion", "prevUrl": "disabled", "nextUrl": "disabled"}